---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.UneditableFabricationPartNotReposition
source: html/33922933-a3ad-d02f-c1e6-09545cd48a1e.htm
---
# Autodesk.Revit.DB.BuiltInFailures.MEPFabricationFailures.UneditableFabricationPartNotReposition Property

Failed to reposition part.

## Syntax (C#)
```csharp
public static FailureDefinitionId UneditableFabricationPartNotReposition { get; }
```